# utility/essential
brew "fish"
brew "ffmpeg"
brew "fzf"
brew "gifsicle"
brew "gpg"
brew "hub"
brew "mas"
brew "mosh"
brew "pinentry-mac"
brew "ssh-copy-id"
brew "tig"
brew "tmuxinator"
brew "tree"
brew "vim"
brew "wget"

# development dependencies
brew "node"
brew "postgresql", restart_service: true
brew "rbenv"
brew "yarn"

# games and fun stuff
brew "archey"
brew "cheat"
brew "cmatrix"
brew "cowsay"
brew "figlet"
brew "fortune"
brew "nethack"
brew "sl"
brew "wakeonlan"
brew "youtube-dl"

# native and gui apps
cask "1password"
cask "aerial"
cask "alfred"
cask "atom"
cask "diskwave"
cask "homebrew/cask-fonts/font-fira-code"
cask "istat-menus"
cask "iterm2"
cask "keybase"
cask "monitorcontrol"
cask "pock"
cask "slack"
cask "spectacle"
cask "telegram"
cask "the-unarchiver"
cask "transmission"
cask "vlc"

# mac app store
mas "com.apple.iWork.Keynote", id: 409183694
mas "com.apple.iWork.Numbers", id: 409203825
mas "com.apple.iWork.Pages", id: 409201541
mas "com.apple.dt.Xcode", id: 497799835
mas "com.giorgiocalderolla.Wipr-Mac", id: 1320666476
mas "com.wireguard.macos", id: 1451685025
mas "com.facebook.archon", id: 1480068668
